using System;
using System.Collections.Generic;
using System.Data.Entity;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using CarsRentEF.Models;

namespace CarsRentEF.EF
{
    public class DataInitializer : DropCreateDatabaseAlways<CarsRentEntities> {
        // Метод должен быть переопределен для фактического добавления данных в контекст для заполнения начальными значениями. Реализация по умолчанию не выполняет никаких действий.
        protected override void Seed(CarsRentEntities context) {
            List<Client> clients = new List<Client> {
                new Client{ФИО = "Орлов М.В.", Адрес = "Я.Коласа, 10-7", Телефон = "878-54-22", НомерПаспорта = "МС8789221", НомерВодУд = "6ЕД3214"},
                new Client{ФИО = "Иванов А.А..", Адрес = "В.Хоружей, 11-67", Телефон = "111-11-11", НомерПаспорта = "МС1111111", НомерВодУд = "4ПР1111"},
                new Client{ФИО = "Петров П.П.", Адрес = "Днепровская, 112", Телефон = "222-22-22", НомерПаспорта = "МС2222222", НомерВодУд = "1НР2222"},
                new Client{ФИО = "Сидоров С.С.", Адрес = "Независимости, 54-78", Телефон = "333-33-33", НомерПаспорта = "МС3333333", НомерВодУд = "2ПР3333"},
                new Client{ФИО = "Олейник В.Н.", Адрес = "Кижеватова, 304", Телефон = "444-44-44", НомерПаспорта = "МС4444444", НомерВодУд = "9НН4444"},
                new Client{ФИО = "Фролов В.Е.", Адрес = "Никифорова, 55-7", Телефон = "555-55-55", НомерПаспорта = "МС5555555", НомерВодУд = "5АА5555"},
                new Client{ФИО = "Абрамович М.Ф.", Адрес = "Острошицкая, 1-78", Телефон = "666-66-66", НомерПаспорта = "МС6666666", НомерВодУд = "8ГГ6666"},
                new Client{ФИО = "Ефремова Н.Л.", Адрес = "Калиновского, 5-41", Телефон = "777-77-77", НомерПаспорта = "МС7777777", НомерВодУд = "5АВ7777"},
                new Client{ФИО = "Климов А.Д.", Адрес = "Жукова, 120", Телефон = "888-88-88", НомерПаспорта = "МС8888888", НомерВодУд = "9ДВ8888"},
                new Client{ФИО = "Кравцова О.В.", Адрес = "Харьковская, 25-71", Телефон = "999-99-99", НомерПаспорта = "МС9999999", НомерВодУд = "7ВЕ9999"},
            };
            clients.ForEach(x => context.Клиенты.Add(x));

            List<Car> cars = new List<Car> {
                new Car {Госномер = "8712 КК-7", VIN = "VWV8725ZXD982118Y", Марка = "Mersedes", Модель = "E-class", ГодВыпуска = 2014, Стоимость = 30000, СтоимостПрокатаВСут = 120, ТипКузова = "Седан", Цвет = "Белый", Статус = "Свободен"},
                new Car {Госномер = "1234 ЕА-7", VIN = "TYH4512316QQ5423B", Марка = "BMW", Модель = "5-series", ГодВыпуска = 2016, Стоимость = 50000, СтоимостПрокатаВСут = 150, ТипКузова = "Универсал", Цвет = "Черный", Статус = "Арендован"},
                new Car {Госномер = "6590 ДВ-7", VIN = "NBK6565653TT5464N", Марка = "Audi", Модель = "A6", ГодВыпуска = 2010, Стоимость = 19000, СтоимостПрокатаВСут = 90, ТипКузова = "Седан", Цвет = "Серебро", Статус = "Свободен"},
                new Car {Госномер = "1199 ЛО-7", VIN = "AAA1111111AA1111A", Марка = "Lexus", Модель = "GS", ГодВыпуска = 2013, Стоимость = 25000, СтоимостПрокатаВСут = 100, ТипКузова = "Седан", Цвет = "Синий", Статус = "Свободен"},
                new Car {Госномер = "4367 ПР-7", VIN = "BBB2222222BB2222B", Марка = "Toyota", Модель = "Prado", ГодВыпуска = 2011, Стоимость = 32000, СтоимостПрокатаВСут = 140, ТипКузова = "Внедорожник", Цвет = "Черный", Статус = "Арендован"},
                new Car {Госномер = "9078 РГ-7", VIN = "CCC3333333CC3333C", Марка = "Ford", Модель = "F150", ГодВыпуска = 2017, Стоимость = 42000, СтоимостПрокатаВСут = 130, ТипКузова = "Пикап", Цвет = "Зеленый", Статус = "Свободен"},
                new Car {Госномер = "1841 КС-7", VIN = "DDD4444444DD4444D", Марка = "VW", Модель = "Passat", ГодВыпуска = 2008, Стоимость = 9000, СтоимостПрокатаВСут = 50, ТипКузова = "Унивесал", Цвет = "Мокрый асфальт", Статус = "Свободен"},
                new Car {Госномер = "6800 СС-7", VIN = "EEE5555555EE5555E", Марка = "KIA", Модель = "Ceed", ГодВыпуска = 2017, Стоимость = 21000, СтоимостПрокатаВСут = 60, ТипКузова = "Хэтчбек", Цвет = "Синий", Статус = "Свободен"},
                new Car {Госномер = "1100 ВА-7", VIN = "FFFF666666FFF666F", Марка = "Skoda", Модель = "Octavia", ГодВыпуска = 2015, Стоимость = 18000, СтоимостПрокатаВСут = 40, ТипКузова = "Хэтчбек", Цвет = "Белый", Статус = "Свободен"},
                new Car {Госномер = "7412 КЕ-7", VIN = "GGG777777GGG7777G", Марка = "Renault", Модель = "Sandero", ГодВыпуска = 2017, Стоимость = 12000, СтоимостПрокатаВСут = 30, ТипКузова = "Хэтчбек", Цвет = "Желтый", Статус = "Свободен"},
                new Car {Госномер = "3312 КК-5", VIN = "VWV4411ZXD987118Y", Марка = "VW", Модель = "Crafter", ГодВыпуска = 2015, Стоимость = 22000, СтоимостПрокатаВСут = 120, ТипКузова = "Микроавтобус", Цвет = "Белый", Статус = "Свободен"},
                new Car { Госномер = "1112 КК-2", VIN = "GWV4411JLD987114Y", Марка = "Ford", Модель = "Transit", ГодВыпуска = 2016, Стоимость = 23000, СтоимостПрокатаВСут = 120, ТипКузова = "Микроавтобус", Цвет = "Синий", Статус = "Свободен" }
            };
            context.Автомобили.AddRange(cars);

            List<Rent> rents = new List<Rent> {
                new Rent{КлиентID = 1, АвтоID = 1, ДатаВыдачи = new DateTime(2017, 5, 1), ДатаВозврата = new DateTime(2017, 6, 1), ИтоговаяСумма = 320, Состояние = "Закрыт"},
                new Rent{КлиентID = 2, АвтоID = 2, ДатаВыдачи = new DateTime(2017, 8, 31), ДатаВозврата = new DateTime(2017, 10, 25), ИтоговаяСумма = 1880, Состояние = "Эксплуатация"},
                new Rent{КлиентID = 3, АвтоID = 3, ДатаВыдачи = new DateTime(2017, 3, 8), ДатаВозврата = new DateTime(2017, 3, 12), ИтоговаяСумма = 510, Состояние = "Закрыт"},
                new Rent{КлиентID = 4, АвтоID = 4, ДатаВыдачи = new DateTime(2016, 12, 1), ДатаВозврата = new DateTime(2016, 12, 12), ИтоговаяСумма = 820, Состояние = "Закрыт"},
                new Rent{КлиентID = 5, АвтоID = 5, ДатаВыдачи = new DateTime(2017, 9, 1), ДатаВозврата = new DateTime(2017, 11, 7), ИтоговаяСумма = 1550, Состояние = "Эксплуатация"},
                new Rent{КлиентID = 6, АвтоID = 6, ДатаВыдачи = new DateTime(2017, 4, 6), ДатаВозврата = new DateTime(2017, 6, 1), ИтоговаяСумма = 900, Состояние = "Закрыт"},
            };
            rents.ForEach(x => context.Аренды.Add(x));

            List<Discount> discounts = new List<Discount> {
                new Discount {НаименованиеСкидки = "Постоянный клиент", Процент = 2},
                new Discount {НаименованиеСкидки = "Свадебная", Процент = 5},
                new Discount {НаименованиеСкидки = "Длительная аренда", Процент = 10},
                new Discount {НаименованиеСкидки = "Рождественская", Процент = 7},
                new Discount {НаименованиеСкидки = "Пенсионная", Процент = 8},
                new Discount {НаименованиеСкидки = "Коммерческий транспорт", Процент = 4}
            };
            discounts.ForEach(x => context.Скидки.Add(x));

            List<Penalty> penalties = new List<Penalty> {
                new Penalty {НаименованиеШтрафа = "Утеря техпаспорта", СуммаШтрафа = 30},
                new Penalty {НаименованиеШтрафа = "Курение в салоне", СуммаШтрафа = 5},
                new Penalty {НаименованиеШтрафа = "Утеря ключей", СуммаШтрафа = 100},
                new Penalty {НаименованиеШтрафа = "Просрочена дата возврата", СуммаШтрафа = 10},
                new Penalty {НаименованиеШтрафа = "Повреждения салона", СуммаШтрафа = 80},
                new Penalty {НаименованиеШтрафа = "Повреждения кузова", СуммаШтрафа = 120},
                new Penalty {НаименованиеШтрафа = "Утеря талона техосмотра", СуммаШтрафа = 40},
                new Penalty {НаименованиеШтрафа = "Утеря номерных знаков", СуммаШтрафа = 150},
            };
            penalties.ForEach(x => context.Штрафы.Add(x));

            context.SaveChanges();
        }
    }
}
